app/views/lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = $1  ORDER BY "items"."created_at" ASC  [["list_id", 1]]
---
      <ul>
        <% @list.items.each do |item| %>