app/views/home/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = $1  [["list_id", 1]]
---
    </thead>
    <% list.items.each do |item| %>