app/controllers/home_controller.rb

SELECT  "lists".* FROM "lists"  ORDER BY created_at DESC LIMIT 5
---
  def index
    @recent_lists = List.order("created_at DESC").limit(5)