app/controllers/items_controller.rb

  def create
    @list = List.find(params[:list_id])
    @list.items.create(item_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "items" ("task", "due_date", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["task", "twitter"], ["due_date", "2015-06-22"], ["list_id", 1], ["created_at", "2015-06-19 14:45:12.982171"], ["updated_at", "2015-06-19 14:45:12.982171"]]

  def complete
    @list = List.find(params[:list_id])
    @item = Item.find(params[:id])
    @item.update_attributes(is_complete: true)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "is_complete" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["is_complete", "t"], ["updated_at", "2015-06-19 19:46:50.230000"], ["id", 1]]

  def destroy
    @list = List.find(params[:list_id])
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 8]]