app/controllers/lists_controller.rb

  def create
    @list = List.create(list_params)
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Home"], ["created_at", "2015-06-19 12:54:00.859048"], ["updated_at", "2015-06-19 12:54:00.859048"]]

  def show
    @list = List.find(params[:id])
    @items = @list.items.order(:created_at)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = $1  ORDER BY "items"."created_at" ASC  [["list_id", 1]]